
public class 객체지향프로그램_4 {
/*
 * 	자바 클래스의 구성 => ***객체지향 특성 (접근지정어, 캡슐화,재사용,수정,추가 )
 * 		--------------------------- public / protected / default / private
 * 									1) 변수 	 2) 메소드	 3) 생성    
 * 									2) 캡슐화 : 데이터보호 => 모든 변수는 private
 * 									3) 재사용 : 변경해서 사용 , 있는 그대로 
 * 											   상속(is-a)		포함(has-a)
 * 									4) 수정  : 오버라이딩, 추가, 오버로딩 
 * 			
 * 	class ClassName
 * 	(
 * 		---------------------------
 * 		변수
 * 		---------------------------
 * 		생성자
 * 		---------------------------
 * 		메소드
 * 		---------------------------
 * 	)
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
}
