/*
 * 
 * 		대입연산자
 * 		연산순서 
 * 		우-좌
 * 		a=10+30 / 1. 10+30 = 40값 / 2. a=40으로 a에다가 값을 넣어준다
 * 		
 * 		=
 * 		+= // ** 누적 , 총합
 * 		-= // **
 * 		*=
 * 		/=
 * 		%=
 * 		<<=
 * 		>>=
 * 		&=
 * 		|=
 * 		^=
 * 		------
 * 		int a = 10
 * 		a+=10 ====> a=a+10 => 20
 * 		a+=1  ====> a=a+1 a++ ++a
 * 
 * 		a+=20 ====> a=a+20 => 30
 * 		a-=20 ====> a=a-20 ==>-10
 * 		a*=10 ====> a=a*10 ==> 100
 * 		a%=2  ====? a=a%2  ==> 5
 */
public class 대입연산자 {

	public static void main(String[] args) {
		int a=10;
		a+=3; // a+=3
		System.out.println(a);
		
	
		
	}
	
	
}
