/*
 * 1. 단일 조건문
 * 		형식)
 * 			if(조건문)
 * 			{
 * 			조건문이 true명 수행하는 문장 작성
 * 			---부정연산자(!) , 비교연산자(==,!=.<.>.<=,=>)---
 * 			   논리연산자(&& , ||)만 사용 가능
 * 			}
 *
 * 2. 선택 조건문
 *			if(조건문)
 *			{
 *			조건문이 true일때 사용되는 문장
 *			}
 *			else
 *			{
 *			조건문이 false일때 사용되는 문장
 *			}
 *			=> if가 없으면 else는 사용되지 못한다 else 단독 사용 불가능
 * 
 * 3. 다중 조건문
 * 			if(조건문)
 * 			{
 * 			조건문이 true일때 처리 = 종료 / false일때 다음 else if문으로 이동
 * 			}
 * 			else if(조건문)
 * 			{
 * 			조건문이 true일때 처리 = 종료 / false일때 다음 else if문으로 이동
 * 			}
 * 			else if(조건문)
 * 			{
 * 			조건문이 true일때 처리 = 종료 / false일때 다음 else if문으로 이동
 * 			}
 * 			else
 * 			{
 * 			// 해당 조건이 없는 경우 처리하는 소스 작성
 * 			}
 * ===============================================================
 * 4. 선택문
 * 5. 반복문 (for-1차) 
 * 
 */



public class 제어문_정리 {

}
